Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsLabel
A dimension labeled by a parameter is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..

Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsInGroup
A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.

Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraintsEQ
A dimension that has EQ constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..

Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures.UndeletedConstraints
A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..

Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures
Failures about Constraint.